<br><br>
<b><font size=100>SQL</font></b>
<br>
<br>
By अंkur गोswami
____

In [1]:
import sqlite3 as sql

In [2]:
class Query:
    def __init__(self, path):
        self.path=path
    def run(self, query):
        conn=sql.connect(self.path)
        cur=conn.execute(query)
        result=cur.fetchall()
        result.insert(0,tuple(i[0] for i in cur.description))
        conn.close()
        return result

In [3]:
query=Query('DEPT_EMP.db')

## SELECT Clause
The SELECT statement is used to select data FROM a database. The data returned is stored in a result table, called the result-set.

___SELECT * FROM EMP;___

In [4]:
query.run('SELECT * FROM EMP;')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7369, 'SMITH', 'CLERK', 7902, '93/6/13', 800, 0, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '98/8/15', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '96/3/26', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '96/3/5', 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, '90/6/9', 5000, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '95/6/4', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '99/6/4', 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, '00/6/23', 950, None, 30),
 (7934, 'MILLER', 'CLERK', 7782, '00/1/21', 1300, None, 10),
 (7902, 'FORD', 'ANALYST', 7566, '97/12/5', 3000, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '98/12/5', 1250, 1400, 30)]

___SELECT SAL FROM EMP;___

In [5]:
query.run('SELECT SAL FROM EMP;')

[('SAL',),
 (800,),
 (1600,),
 (1250,),
 (2975,),
 (2850,),
 (2450,),
 (3000,),
 (5000,),
 (1500,),
 (1100,),
 (950,),
 (1300,),
 (3000,),
 (1250,)]

___SELECT ENAME, SAL FROM EMP;___

In [6]:
query.run('SELECT ENAME, SAL FROM EMP;')

[('ENAME', 'SAL'),
 ('SMITH', 800),
 ('ALLEN', 1600),
 ('WARD', 1250),
 ('JONES', 2975),
 ('BLAKE', 2850),
 ('CLARK', 2450),
 ('SCOTT', 3000),
 ('KING', 5000),
 ('TURNER', 1500),
 ('ADAMS', 1100),
 ('JAMES', 950),
 ('MILLER', 1300),
 ('FORD', 3000),
 ('MARTIN', 1250)]

## WHERE Clause
The WHERE clause is used to filter records. The WHERE clause is used to extract only those records that fulfill a specified condition.

### Comparison Operators:
Equal to: `=`<br>
Not equal to: `!=` and `<>`
Greater than: `>`<br>
Less than: `<`<br>
Greater than or equal to: `>=`<br>
Less than or equal to: `<=`<br>

___SELECT * FROM EMP <br>
WHERE JOB = 'MANAGER';___<br>

In [7]:
query.run('''SELECT * FROM EMP
            WHERE JOB='MANAGER';''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10)]

## AND operator
The AND operator displays a record if all the conditions separated by AND are TRUE.

___SELECT * FROM EMP<br>
WHERE JOB='SALESMAN'<br>
AND SAL>=1300;<br>___

In [8]:
query.run('''SELECT * FROM EMP
            WHERE JOB='SALESMAN'
            AND SAL>=1300;
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7499, 'ALLEN', 'SALESMAN', 7698, '98/8/15', 1600, 300, 30),
 (7844, 'TURNER', 'SALESMAN', 7698, '95/6/4', 1500, 0, 30)]

## OR operator
The OR operator displays a record if any of the conditions separated by OR is TRUE.

___SELECT * FROM EMP<br>
WHERE JOB='SALESMAN'<br>
OR SAL>=1300;<br>___

In [9]:
query.run('''SELECT * FROM EMP
            WHERE JOB='SALESMAN'
            OR SAL>=1300;
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7499, 'ALLEN', 'SALESMAN', 7698, '98/8/15', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '96/3/26', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '96/3/5', 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, '90/6/9', 5000, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '95/6/4', 1500, 0, 30),
 (7934, 'MILLER', 'CLERK', 7782, '00/1/21', 1300, None, 10),
 (7902, 'FORD', 'ANALYST', 7566, '97/12/5', 3000, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '98/12/5', 1250, 1400, 30)]

___SELECT ENAME FROM EMP<br>
WHERE (JOB <> MANAGER AND JOB != SALESMAN)<br>
AND SAL >= 2000;___<br>

In [10]:
query.run('''SELECT ENAME FROM EMP
            WHERE (JOB <> 'MANAGER' AND JOB != 'SALESMAN')
            AND SAL >= 2000;
        ''')

[('ENAME',), ('SCOTT',), ('KING',), ('FORD',)]

## IN operator
The IN operator allows you to specify multiple values in a WHERE clause. The IN operator is a shorthand for multiple OR conditions.

___SELECT * FROM EMP<br>
WHERE JOB IN ('ANALYST','CLERK');___<br>

In [11]:
query.run('''SELECT * FROM EMP
            WHERE JOB IN ('ANALYST','CLERK');
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7369, 'SMITH', 'CLERK', 7902, '93/6/13', 800, 0, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, '96/3/5', 3000, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '99/6/4', 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, '00/6/23', 950, None, 30),
 (7934, 'MILLER', 'CLERK', 7782, '00/1/21', 1300, None, 10),
 (7902, 'FORD', 'ANALYST', 7566, '97/12/5', 3000, None, 20)]

## BETWEEN operator
The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates. The BETWEEN operator is inclusive: begin and end values are included.

___SELECT * FROM EMP<br>
WHERE HIREDATE BETWEEN '93/5/14' AND '99/6/4';___<br>

In [12]:
query.run('''SELECT * FROM EMP
            WHERE HIREDATE BETWEEN '93/5/14' AND '99/6/4';
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7369, 'SMITH', 'CLERK', 7902, '93/6/13', 800, 0, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '98/8/15', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '96/3/26', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '96/3/5', 3000, None, 20),
 (7844, 'TURNER', 'SALESMAN', 7698, '95/6/4', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '99/6/4', 1100, None, 20),
 (7902, 'FORD', 'ANALYST', 7566, '97/12/5', 3000, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '98/12/5', 1250, 1400, 30)]

## NOT operator
The NOT operator displays a record if the condition(s) is NOT TRUE.

___SELECT * FROM EMP<br>
WHERE JOB NOT IN ('ANALYST','CLERK');___<br>

In [13]:
query.run('''SELECT * FROM EMP
            WHERE JOB NOT IN ('ANALYST','CLERK');
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7499, 'ALLEN', 'SALESMAN', 7698, '98/8/15', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '96/3/26', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10),
 (7839, 'KING', 'PRESIDENT', None, '90/6/9', 5000, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '95/6/4', 1500, 0, 30),
 (7654, 'MARTIN', 'SALESMAN', 7698, '98/12/5', 1250, 1400, 30)]

___SELECT * FROM EMP<br>
WHERE HIREDATE NOT BETWEEN '93/5/14' AND '99/6/4';___<br>

In [14]:
query.run('''SELECT * FROM EMP
            WHERE HIREDATE NOT BETWEEN '93/5/14' AND '99/6/4';
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7839, 'KING', 'PRESIDENT', None, '90/6/9', 5000, 0, 10),
 (7900, 'JAMES', 'CLERK', 7698, '00/6/23', 950, None, 30),
 (7934, 'MILLER', 'CLERK', 7782, '00/1/21', 1300, None, 10)]

## IS operator
Equivalent to `=` operator.

___SELECT * FROM EMP <br>
WHERE JOB IS 'MANAGER';___<br>

In [15]:
query.run('''SELECT * FROM EMP
            WHERE JOB='MANAGER';''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10)]

## NULL values

___SELECT * FROM EMP <br>
WHERE COMM IS NULL;___<br>

In [16]:
query.run('''SELECT * FROM EMP
            WHERE COMM IS NULL;''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '96/3/5', 3000, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '99/6/4', 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, '00/6/23', 950, None, 30),
 (7934, 'MILLER', 'CLERK', 7782, '00/1/21', 1300, None, 10),
 (7902, 'FORD', 'ANALYST', 7566, '97/12/5', 3000, None, 20)]

___SELECT * FROM EMP <br>
WHERE COMM = NULL;___<br>

In [17]:
query.run('''SELECT * FROM EMP
            WHERE COMM=NULL;''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO')]

__Note:__ `NOT` & `=` are not equivalent in case of a null value.

## LIKE Clause
The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

### Wildcards

### %
Represents zero or more characters.

___SELECT * FROM EMP<br>
WHERE JOB LIKE '%MAN';___<br>

In [18]:
query.run('''SELECT * FROM EMP
            WHERE JOB LIKE '%MAN';
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7499, 'ALLEN', 'SALESMAN', 7698, '98/8/15', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '96/3/26', 1250, 500, 30),
 (7844, 'TURNER', 'SALESMAN', 7698, '95/6/4', 1500, 0, 30),
 (7654, 'MARTIN', 'SALESMAN', 7698, '98/12/5', 1250, 1400, 30)]

___SELECT * FROM EMP<br>
WHERE JOB LIKE 'MAN%';___<br>

In [19]:
query.run('''SELECT * FROM EMP
            WHERE JOB LIKE 'MAN%';
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10)]

___SELECT * FROM EMP<br>
WHERE JOB LIKE '%MAN%';___<br>

In [20]:
query.run('''SELECT * FROM EMP
            WHERE JOB LIKE '%MAN%';
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7499, 'ALLEN', 'SALESMAN', 7698, '98/8/15', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '96/3/26', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, '92/6/11', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '93/5/14', 2450, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '95/6/4', 1500, 0, 30),
 (7654, 'MARTIN', 'SALESMAN', 7698, '98/12/5', 1250, 1400, 30)]

### _
Represents a single character

___SELECT * FROM EMP<br>
WHERE ENAME LIKE '\_\_\_\_S';___<br>

In [21]:
query.run('''SELECT * FROM EMP
            WHERE ENAME LIKE '____S';
            ''')

[('EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'),
 (7566, 'JONES', 'MANAGER', 7839, '95/10/31', 2975, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '99/6/4', 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, '00/6/23', 950, None, 30)]

## ALIAS

___SELECT ENAME AS Employee, SAL AS Salary, COMM AS Commision <br>
FROM EMP;___<br>

In [22]:
query.run('''SELECT ENAME AS Employee, SAL AS Salary, COMM AS Commision
            FROM EMP;
            ''')

[('Employee', 'Salary', 'Commision'),
 ('SMITH', 800, 0),
 ('ALLEN', 1600, 300),
 ('WARD', 1250, 500),
 ('JONES', 2975, None),
 ('BLAKE', 2850, None),
 ('CLARK', 2450, None),
 ('SCOTT', 3000, None),
 ('KING', 5000, 0),
 ('TURNER', 1500, 0),
 ('ADAMS', 1100, None),
 ('JAMES', 950, None),
 ('MILLER', 1300, None),
 ('FORD', 3000, None),
 ('MARTIN', 1250, 1400)]

__Note:__ Cannot use whitespaces while aliasing columns. Instead use underscore in place of whitespace or put column alias names in double quotes.

__Note:__ Not writing `AS` will still work. But it's a convention to do aliasing using `AS`, as it is more-readable & works with most databases.

___SELECT ENAME "Employee name", SAL Salary, COMM Commision <br>
FROM EMP;___<br>

In [23]:
query.run('''SELECT ENAME "Employee name", SAL Salary, COMM Commision 
            FROM EMP;
            ''')

[('Employee name', 'Salary', 'Commision'),
 ('SMITH', 800, 0),
 ('ALLEN', 1600, 300),
 ('WARD', 1250, 500),
 ('JONES', 2975, None),
 ('BLAKE', 2850, None),
 ('CLARK', 2450, None),
 ('SCOTT', 3000, None),
 ('KING', 5000, 0),
 ('TURNER', 1500, 0),
 ('ADAMS', 1100, None),
 ('JAMES', 950, None),
 ('MILLER', 1300, None),
 ('FORD', 3000, None),
 ('MARTIN', 1250, 1400)]

## CONCATENATION

### Using ||:
`||` is used to concatenate two or more strings.

___SELECT 'My Name is ' || ENAME<br>
FROM EMP;___<br>

In [24]:
query.run('''SELECT 'My Name is ' || ENAME
            FROM EMP;
            ''')

[("'My Name is ' || ENAME",),
 ('My Name is SMITH',),
 ('My Name is ALLEN',),
 ('My Name is WARD',),
 ('My Name is JONES',),
 ('My Name is BLAKE',),
 ('My Name is CLARK',),
 ('My Name is SCOTT',),
 ('My Name is KING',),
 ('My Name is TURNER',),
 ('My Name is ADAMS',),
 ('My Name is JAMES',),
 ('My Name is MILLER',),
 ('My Name is FORD',),
 ('My Name is MARTIN',)]

___SELECT ENAME || ' makes $' || SAL || ' per month.' AS "Generated Report"<br>
FROM EMP;___<br>

In [25]:
query.run('''SELECT ENAME || ' is a ' || JOB || ' and makes $' || SAL || ' per month.' AS "Generated Report"
            FROM EMP;
            ''')

[('Generated Report',),
 ('SMITH is a CLERK and makes $800 per month.',),
 ('ALLEN is a SALESMAN and makes $1600 per month.',),
 ('WARD is a SALESMAN and makes $1250 per month.',),
 ('JONES is a MANAGER and makes $2975 per month.',),
 ('BLAKE is a MANAGER and makes $2850 per month.',),
 ('CLARK is a MANAGER and makes $2450 per month.',),
 ('SCOTT is a ANALYST and makes $3000 per month.',),
 ('KING is a PRESIDENT and makes $5000 per month.',),
 ('TURNER is a SALESMAN and makes $1500 per month.',),
 ('ADAMS is a CLERK and makes $1100 per month.',),
 ('JAMES is a CLERK and makes $950 per month.',),
 ('MILLER is a CLERK and makes $1300 per month.',),
 ('FORD is a ANALYST and makes $3000 per month.',),
 ('MARTIN is a SALESMAN and makes $1250 per month.',)]

### Using CONCAT():
CONCAT() takes 2 values as parameters and returns a concatenated result.

## SORTING

___SELECT ENAME, JOB<br>
FROM EMP<br>
ORDER BY ENAME;___<br>

In [26]:
query.run('''SELECT ENAME, JOB
            FROM EMP
            ORDER BY ENAME;
        ''')

[('ENAME', 'JOB'),
 ('ADAMS', 'CLERK'),
 ('ALLEN', 'SALESMAN'),
 ('BLAKE', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('FORD', 'ANALYST'),
 ('JAMES', 'CLERK'),
 ('JONES', 'MANAGER'),
 ('KING', 'PRESIDENT'),
 ('MARTIN', 'SALESMAN'),
 ('MILLER', 'CLERK'),
 ('SCOTT', 'ANALYST'),
 ('SMITH', 'CLERK'),
 ('TURNER', 'SALESMAN'),
 ('WARD', 'SALESMAN')]

__Note:__ Sorting is implicitly Ascending in SQL.

### Explicit Ascending order:

___SELECT ENAME, JOB<br>
FROM EMP<br>
ORDER BY SAL ASC;___<br>

In [27]:
query.run('''SELECT ENAME, SAL
            FROM EMP
            ORDER BY SAL ASC;
        ''')

[('ENAME', 'SAL'),
 ('SMITH', 800),
 ('JAMES', 950),
 ('ADAMS', 1100),
 ('WARD', 1250),
 ('MARTIN', 1250),
 ('MILLER', 1300),
 ('TURNER', 1500),
 ('ALLEN', 1600),
 ('CLARK', 2450),
 ('BLAKE', 2850),
 ('JONES', 2975),
 ('SCOTT', 3000),
 ('FORD', 3000),
 ('KING', 5000)]

### Descending order:

___SELECT ENAME, JOB<br>
FROM EMP<br>
ORDER BY SAL DESC;___<br>

In [28]:
query.run('''SELECT ENAME, SAL
            FROM EMP
            ORDER BY SAL DESC;
        ''')

[('ENAME', 'SAL'),
 ('KING', 5000),
 ('SCOTT', 3000),
 ('FORD', 3000),
 ('JONES', 2975),
 ('BLAKE', 2850),
 ('CLARK', 2450),
 ('ALLEN', 1600),
 ('TURNER', 1500),
 ('MILLER', 1300),
 ('WARD', 1250),
 ('MARTIN', 1250),
 ('ADAMS', 1100),
 ('JAMES', 950),
 ('SMITH', 800)]

### Multilevel Sorting

___SELECT DEPTNO, SAL, ENAME<br>
FROM EMP<br>
ORDER BY DEPTNO, SAL DESC, ENAME;___<br>

In [29]:
query.run('''SELECT DEPTNO, SAL, ENAME
            FROM EMP
            ORDER BY DEPTNO, SAL DESC, ENAME;
        ''')

[('DEPTNO', 'SAL', 'ENAME'),
 (10, 5000, 'KING'),
 (10, 2450, 'CLARK'),
 (10, 1300, 'MILLER'),
 (20, 3000, 'FORD'),
 (20, 3000, 'SCOTT'),
 (20, 2975, 'JONES'),
 (20, 1100, 'ADAMS'),
 (20, 800, 'SMITH'),
 (30, 2850, 'BLAKE'),
 (30, 1600, 'ALLEN'),
 (30, 1500, 'TURNER'),
 (30, 1250, 'MARTIN'),
 (30, 1250, 'WARD'),
 (30, 950, 'JAMES')]

# SQL Functions
Can be used with SELECT as well as WHERE clause.

## LOWER()
To convert data into lowercase.

___SELECT LOWER(ENAME) AS Name, HIREDATE<br>
FROM EMP;___<br>

In [30]:
query.run('''SELECT LOWER(ENAME) AS Name, HIREDATE
            FROM EMP;
        ''')

[('Name', 'HIREDATE'),
 ('smith', '93/6/13'),
 ('allen', '98/8/15'),
 ('ward', '96/3/26'),
 ('jones', '95/10/31'),
 ('blake', '92/6/11'),
 ('clark', '93/5/14'),
 ('scott', '96/3/5'),
 ('king', '90/6/9'),
 ('turner', '95/6/4'),
 ('adams', '99/6/4'),
 ('james', '00/6/23'),
 ('miller', '00/1/21'),
 ('ford', '97/12/5'),
 ('martin', '98/12/5')]

## UPPER()
To convert data into uppercase.

## DISTINCT()
Returns unique values in a column.

___SELECT DISTINCT(JOB)<br>
FROM EMP;___<br>

In [31]:
query.run('''SELECT DISTINCT(JOB)
            FROM EMP;
        ''')

[('JOB',),
 ('CLERK',),
 ('SALESMAN',),
 ('MANAGER',),
 ('ANALYST',),
 ('PRESIDENT',)]

## LENGTH()
Returns length of a string.

___SELECT ENAME, LENGTH(ENAME)<br>
FROM EMP;___<br>

In [32]:
query.run('''SELECT ENAME, LENGTH(ENAME)
            FROM EMP;
        ''')

[('ENAME', 'LENGTH(ENAME)'),
 ('SMITH', 5),
 ('ALLEN', 5),
 ('WARD', 4),
 ('JONES', 5),
 ('BLAKE', 5),
 ('CLARK', 5),
 ('SCOTT', 5),
 ('KING', 4),
 ('TURNER', 6),
 ('ADAMS', 5),
 ('JAMES', 5),
 ('MILLER', 6),
 ('FORD', 4),
 ('MARTIN', 6)]

## COUNT()
Returns count of values in a column.

___SELECT COUNT(ENAME)<br>
FROM EMP;___<br>

In [33]:
query.run('''SELECT COUNT(ENAME)
            FROM EMP;
        ''')

[('COUNT(ENAME)',), (14,)]

In [74]:
conn=sql.connect("DEPT_EMP.db")

In [90]:
cur=conn.execute("SELECT * FROM EMP;")

In [89]:
cur.fetchall()

[]

In [93]:
a=cur.fetchall()

In [9]:
conn=sql.connect('DEPT_EMP.db')
STRING='''
DROP TABLE IF EXISTS dept;
DROP TABLE IF EXISTS emp;

CREATE TABLE DEPT(
DEPTNO int(2) not null primary key,
DNAME varchar(50) not null,
LOCATION varchar(50) not null);

CREATE TABLE EMP(
EMPNO int(4) not null primary key,
ENAME varchar(50) not null,
JOB varchar(50) not null,
MGR int(4),
HIREDATE date,
SAL decimal(10,2),
COMM decimal(10,2),
DEPTNO int(2) not null);

insert into dept values (10,'Accounting','New York');

insert into dept values (20,'Research','Dallas');

insert into dept values (30,'Sales','Chicago');

insert into dept values (40,'Operations','Boston');



insert into emp values (7369,'SMITH','CLERK',7902,'93/6/13',800,0.00,20);

insert into emp values (7499,'ALLEN','SALESMAN',7698,'98/8/15',1600,300,30);

insert into emp values (7521,'WARD','SALESMAN',7698,'96/3/26',1250,500,30);

insert into emp values (7566,'JONES','MANAGER',7839,'95/10/31',2975,null,20);

insert into emp values (7698,'BLAKE','MANAGER',7839,'92/6/11',2850,null,30);

insert into emp values (7782,'CLARK','MANAGER',7839,'93/5/14',2450,null,10);

insert into emp values (7788,'SCOTT','ANALYST',7566,'96/3/5',3000,null,20);

insert into emp values (7839,'KING','PRESIDENT',null,'90/6/9',5000,0,10);

insert into emp values (7844,'TURNER','SALESMAN',7698,'95/6/4',1500,0,30);

insert into emp values (7876,'ADAMS','CLERK',7788,'99/6/4',1100,null,20);

insert into emp values (7900,'JAMES','CLERK',7698,'00/6/23',950,null,30);

insert into emp values (7934,'MILLER','CLERK',7782,'00/1/21',1300,null,10);

insert into emp values (7902,'FORD','ANALYST',7566,'97/12/5',3000,null,20);

insert into emp values (7654,'MARTIN','SALESMAN',7698,'98/12/5',1250,1400,30);
'''
a=STRING.split(';')
for i in range(len(a)):
    print(a[i])
    cur=conn.execute(a[i].strip()+';')
conn.commit()
conn.close()

DROP TABLE IF EXISTS dept

DROP TABLE IF EXISTS emp


CREATE TABLE DEPT(
DEPTNO int(2) not null primary key,
DNAME varchar(50) not null,
LOCATION varchar(50) not null)


CREATE TABLE EMP(
EMPNO int(4) not null primary key,
ENAME varchar(50) not null,
JOB varchar(50) not null,
MGR int(4),
HIREDATE date,
SAL decimal(10,2),
COMM decimal(10,2),
DEPTNO int(2) not null)


insert into dept values (10,'Accounting','New York')


insert into dept values (20,'Research','Dallas')


insert into dept values (30,'Sales','Chicago')


insert into dept values (40,'Operations','Boston')




insert into emp values (7369,'SMITH','CLERK',7902,'93/6/13',800,0.00,20)


insert into emp values (7499,'ALLEN','SALESMAN',7698,'98/8/15',1600,300,30)


insert into emp values (7521,'WARD','SALESMAN',7698,'96/3/26',1250,500,30)


insert into emp values (7566,'JONES','MANAGER',7839,'95/10/31',2975,null,20)


insert into emp values (7698,'BLAKE','MANAGER',7839,'92/6/11',2850,null,30)


insert into emp values (7782,'CLARK','MANAGER',7839,'93/5/14',2450,null,10)


insert into emp values (7788,'SCOTT','ANALYST',7566,'96/3/5',3000,null,20)


insert into emp values (7839,'KING','PRESIDENT',null,'90/6/9',5000,0,10)


insert into emp values (7844,'TURNER','SALESMAN',7698,'95/6/4',1500,0,30)


insert into emp values (7876,'ADAMS','CLERK',7788,'99/6/4',1100,null,20)


insert into emp values (7900,'JAMES','CLERK',7698,'00/6/23',950,null,30)


insert into emp values (7934,'MILLER','CLERK',7782,'00/1/21',1300,null,10)


insert into emp values (7902,'FORD','ANALYST',7566,'97/12/5',3000,null,20)


insert into emp values (7654,'MARTIN','SALESMAN',7698,'98/12/5',1250,1400,30)

# Insertion

In [4]:
cur=conn.execute("insert into Employee values(1,'Ankur Goswami',19,200000);")

In [5]:
cur=conn.execute("insert into Employee values(2,'Murtaza Nazir',21,10000)")
cur=conn.execute("insert into Employee(empid,empname,age) values(3,'RJ Rahul',21)")

In [6]:
cur=conn.execute("insert into Employee values(4,'Naveed Unjum',21,0)")

# Displaying

In [7]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000),
 (2, 'Murtaza Nazir', 21, 10000),
 (3, 'RJ Rahul', 21, 10000),
 (4, 'Naveed Unjum', 21, 0)]

# Deletion

In [8]:
cur=conn.execute("delete from Employee where empid=4")

In [9]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000),
 (2, 'Murtaza Nazir', 21, 10000),
 (3, 'RJ Rahul', 21, 10000)]

In [10]:
cur=conn.execute("insert into Employee values(4,'Naveed Unjum',21,0)")

# Update

In [11]:
cur=conn.execute("update Employee set empname='Naveed Unjum(Unemployed)' where salary=0")

In [12]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000),
 (2, 'Murtaza Nazir', 21, 10000),
 (3, 'RJ Rahul', 21, 10000),
 (4, 'Naveed Unjum(Unemployed)', 21, 0)]

# Adding Columns

In [13]:
cur=conn.execute("alter table Employee add column dept varchar(3)")

In [14]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (4, 'Naveed Unjum(Unemployed)', 21, 0, None)]

In [15]:
cur=conn.execute("alter table Employee drop dept")

OperationalError: near "drop": syntax error

In [16]:
cur=conn.execute('select * from Employee')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (4, 'Naveed Unjum(Unemployed)', 21, 0, None)]

# Comparison

**`<>`** and **`!=`** are **`not equal`** to operators.

In [18]:
cur=conn.execute('select empname from Employee where age<>21')
cur.fetchall()

[('Ankur Goswami',)]

In [19]:
cur=conn.execute("insert into Employee values(5,'aNKUR gOSWAMI',19,50000,null)")

# Regex

In [20]:
cur=conn.execute('select * from Employee where empname like "%KUR%"')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None), (5, 'aNKUR gOSWAMI', 19, 50000, None)]

In [27]:
cur=conn.execute('select * from Employee where empname like "n%)"')
cur.fetchall()

[(4, 'Naveed Unjum(Unemployed)', 21, 0, None)]

In [28]:
cur=conn.execute('select * from Employee where empname like "%r%"')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (5, 'aNKUR gOSWAMI', 19, 50000, None)]

In [30]:
cur=conn.execute('select * from Employee where empname like "%u_"')
cur.fetchall()

[(3, 'RJ Rahul', 21, 10000, None)]

In [46]:
cur=conn.execute('select * from Employee where empname not like "______________%"')
cur.fetchall()

[(1, 'Ankur Goswami', 19, 200000, None),
 (2, 'Murtaza Nazir', 21, 10000, None),
 (3, 'RJ Rahul', 21, 10000, None),
 (5, 'aNKUR gOSWAMI', 19, 50000, None)]

begin with a and with a
name contains atleast 1 r
name with last but one char is y
max of 5 chars

# SQL

# Displaying Table

SELECT * FROM EMP;